---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetStartConstraint
source: html/6f5516f2-6715-c642-4d73-ccf85be35178.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetStartConstraint Method

Gets the current constraint for the start handle of the Rebar.

## Syntax (C#)
```csharp
public RebarConstraint GetStartConstraint()
```

## Returns
Returns the current constraint for the start handle of the Rebar. Return value is null if no constraint is present.